# Titanic Dataset Analysis

In [2]:
# importing important libraries for analysis 
import pandas as pd
import numpy as np

### Data Aquisition

In [3]:
# loading the dataset
df = pd.read_csv("titanic dataset.csv")

### Data Exploration

In [4]:
# displaying the head of the data set
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# exploring the dataset info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
# exploring the dataset mesurements and quartiles 
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

        Conclusion: Looking to the Age column, there are outliers in this data. the max age "80" is much more bigger than   the fourth quartile 75% "38".

In [25]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Data Analysis

In [7]:
# Drop unuseful data

data_frame = df.drop(['PassengerId','Name', 'Ticket','Fare','Cabin'], axis = 1)
data_frame.head()

   Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

In [8]:
# rename the embrarked label data to be more readable 

data_frame.loc[:,'Embarked'].replace(['C','S','Q'],['Cherbourg','Southampton','Queenstown'],inplace=True)

In [9]:
data_frame.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Embarked
0         0       3    male  22.0      1      0  Southampton
1         1       1  female  38.0      1      0    Cherbourg
2         1       3  female  26.0      0      0  Southampton
3         1       1  female  35.0      1      0  Southampton
4         0       3    male  35.0      0      0  Southampton

In [11]:
# counting numbers of males and females in the dataset
data_frame.value_counts('Sex')

Sex
male      577
female    314
dtype: int64

In [36]:
# counting number of passengers embarked of each station
data_frame.value_counts('Embarked')

Embarked
Southampton    644
Cherbourg      168
Queenstown      77
dtype: int64

In [12]:
# min and max age of the passengers 
data_frame['Age'].min(), data_frame['Age'].max()

(0.42, 80.0)

#### Q1: Did Age number affected the surviving chance?

In [57]:

Age = data_frame[['Survived','Age']] # creating data frame with age and survived people

Age.fillna(Age['Age'].mean(), inplace = True) # filling the missing data
category_1 = 0  # 0:20 years old
category_2 = 0  # 20:40 years old
category_3 = 0  # 40:80 years old
for i in range(len(Age)):
    if Age['Age'][i] >= 0 and Age['Age'][i] <=20:
        if Age['Survived'][i] == 1:
            category_1 +=1
    elif Age['Age'][i] > 20 and Age['Age'][i] <=40:
        if Age['Survived'][i] == 1:
            category_2 +=1
    elif Age['Age'][i] > 40 and Age['Age'][i] <=80:
        if Age['Survived'][i] == 1:
            category_3 +=1

data1 = {'Category 1':[category_1],'Category 2':[category_2],'Category 3':[category_3]}
data1 = pd.DataFrame(data)
data1

C:\Users\mm557\anaconda3\lib\site-packages\pandas\core\frame.py:4317: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

   Category 1  Category 2  Category 3
0          82         205          55

        It is clear that the majority of survivals were in category 2 within the range of 20 to 40 years old

#### Q2: Did gender affected the surviving chance?

In [60]:
gender = data_frame[['Survived','Sex']] # creating data frame with survived people versus gender
gender.value_counts('Sex')
male = 0
female = 0
for i in range(len(Age)):
    if gender['Sex'][i] == 'male':
        if gender['Survived'][i] == 1:
            male +=1
    elif gender['Sex'][i] == 'female':
        if gender['Survived'][i] == 1:
            female += 1
# calculating the percent of survival for each cateory
male_survival_percent = (male/gender.value_counts('Sex')['male'])*100
female_survival_percent = (female/gender.value_counts('Sex')['female'])*100

# gathering info in dataframe
data2 = {'Males Survived':[male],
         'male_survival_percent': [male_survival_percent],
         'Femal Survived': [female],
         'female_survival_percent':[female_survival_percent],         
        }
data2 = pd.DataFrame(data2)
data2

,Males Survived,male_survival_percent,Femal Survived,female_survival_percent
0,109,18.890815,233,74.203822

        from these statistics, we can figure out that the rescue boats were boarding females first, thus the percentage of   survived men was very low!

#### Q3: Did the embarked place affected the passenger chance of survival?

In [69]:
embarked = data_frame[['Survived','Embarked']] # creating data frame with survived people versus embarked location
Southampton = 0
Cherbourg = 0
Queenstown = 0

for i in range(len(Age)):
    if embarked['Embarked'][i] == 'Southampton':
        if embarked['Survived'][i] == 1:
            Southampton +=1
    elif embarked['Embarked'][i] == 'Cherbourg':
        if embarked['Survived'][i] == 1:
            Cherbourg += 1
    elif embarked['Embarked'][i] == 'Queenstown':
        if embarked['Survived'][i] == 1:
            Queenstown += 1
# calculating the percentage of survival from each state            
Southampton_survival_percent = (Southampton/embarked.value_counts('Embarked')['Southampton'])*100
Cherbourg_survival_percent = (Cherbourg/embarked.value_counts('Embarked')['Cherbourg'])*100
Queenstown_survival_percent = (Queenstown/embarked.value_counts('Embarked')['Queenstown'])*100

data3 = {'Southampton Survived':[Southampton],
         'Southampton_survival_percent': [Southampton_survival_percent],
         'Cherbourg Survived': [Cherbourg],
         'Cherbourg_survival_percent':[Cherbourg_survival_percent],
         'Queenstown Survived': [Queenstown],
         'Queenstown_survival_percent':[Queenstown_survival_percent],         
        }
data3 = pd.DataFrame(data3)
data3

,Southampton Survived,Southampton_survival_percent,Cherbourg Survived,Cherbourg_survival_percent,Queenstown Survived,Queenstown_survival_percent
0,217,33.695652,93,55.357143,30,38.961039

        conclusion: Most survival was from southhampton, but it is normal because the number of passengers from this location was the biggest, it is almost no relation between the embarked place and chance of survival.